OpenNuvoton/M031BSP/SampleCode/RegBased/USCI_SPI_PDMA_LoopTest/main.c
    /* Set slave selection signal active low : for master */
    USPI0->LINECTL |= USPI_LINECTL_CTLOINV_Msk;

    /* Set operating mode and transfer timing : for master and mode 0 */
    USPI0->PROTCTL &= ~(USPI_PROTCTL_SCLKMODE_Msk | USPI_PROTCTL_AUTOSS_Msk | USPI_PROTCTL_SLAVE_Msk);
    USPI0->PROTCTL |= (USPI_MASTER | USPI_MODE_0);

    /* Set USPI bus clock : 2000000Hz */
    PCLK0Div = (CLK->PCLKDIV & CLK_PCLKDIV_APB0DIV_Msk) >> CLK_PCLKDIV_APB0DIV_Pos;
    u32Pclk = (SystemCoreClock >> PCLK0Div);

    u32ClkDiv = (((((u32Pclk / 2) * 10) / (2000000)) + 5) / 10) - 1; /* Compute proper divider for USPI clock */
    USPI0->BRGEN &= ~USPI_BRGEN_CLKDIV_Msk;
    USPI0->BRGEN |= (u32ClkDiv << USPI_BRGEN_CLKDIV_Pos);

    USPI0->PROTCTL |= USPI_PROTCTL_PROTEN_Msk;

    /* Enable the automatic hardware slave selection function and configure USCI_SPI_SS pin as low-active. */
    USPI0->LINECTL = (USPI0->LINECTL & ~USPI_LINECTL_CTLOINV_Msk) | USPI_SS_ACTIVE_LOW;
    USPI0->PROTCTL |= USPI_PROTCTL_AUTOSS_Msk;

    /* Configure USCI_SPI1 */
    /* Configure USCI_SPI1 as a slave, clock idle low, 16-bit transaction, drive output on falling clock edge and latch input on rising edge. */
    /* Configure USCI_SPI1 as a low level active device. USCI_SPI peripheral clock rate = f_PCLK1 */

    /* Enable USPI protocol */
    USPI1->CTL &= ~USPI_CTL_FUNMODE_Msk;
    USPI1->CTL = 1 << USPI_CTL_FUNMODE_Pos;

    /* Data format configuration : 16-bit */
    USPI1->LINECTL &= ~USPI_LINECTL_DWIDTH_Msk;
    USPI1->LINECTL |= (0 << USPI_LINECTL_DWIDTH_Pos);

    /* MSB data format */
    USPI1->LINECTL &= ~USPI_LINECTL_LSB_Msk;

    /* Set slave selection signal active low : for slave */
    USPI1->CTLIN0 |= USPI_CTLIN0_ININV_Msk;

    /* Set operating mode and transfer timing : for slave and mode 0 */
    USPI1->PROTCTL &= ~(USPI_PROTCTL_SCLKMODE_Msk | USPI_PROTCTL_AUTOSS_Msk | USPI_PROTCTL_SLAVE_Msk);
    USPI1->PROTCTL |= (USPI_SLAVE | USPI_MODE_0);

    /* Set USPI bus clock */
    USPI1->BRGEN &= ~USPI_BRGEN_CLKDIV_Msk;

    USPI1->PROTCTL |=  USPI_PROTCTL_PROTEN_Msk;

}

void UsciSpiLoopTest_WithPDMA(void)
{
    uint32_t u32DataCount, u32TestCycle;
    uint32_t u32RegValue, u32Abort;
    int32_t i32Err;

    USPI_T *UspiMaster = USPI0;
    USPI_T *UspiSlave  = USPI1;


    printf("\nUSCI_SPI0/1 Loop test with PDMA ");

    /* Source data initiation */
    for (u32DataCount = 0; u32DataCount < TEST_COUNT; u32DataCount++)
    {
        g_au16MasterToSlaveTestPattern[u32DataCount] = 0x5500 | (u32DataCount + 1);
        g_au16SlaveToMasterTestPattern[u32DataCount] = 0xAA00 | (u32DataCount + 1);
    }


    /* Enable PDMA channels */
    PDMA->CHCTL |= ((1 << USPI_MASTER_TX_DMA_CH) | (1 << USPI_MASTER_RX_DMA_CH) | (1 << USPI_SLAVE_RX_DMA_CH) | (1 << USPI_SLAVE_TX_DMA_CH));

    /*=======================================================================
      USCI_SPI master PDMA TX channel configuration:
      -----------------------------------------------------------------------
        Word length = 16 bits
        Transfer Count = TEST_COUNT
        Source = g_au16MasterToSlaveTestPattern
        Source Address = Increasing
        Destination = USCI_SPI0->TX
        Destination Address = Fixed
        Burst Type = Single Transfer
    =========================================================================*/
    /* Set transfer width (16 bits) and transfer count */
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_TXCNT_Msk | PDMA_DSCT_CTL_TXWIDTH_Msk);
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL |= (PDMA_WIDTH_16 | ((TEST_COUNT - 1) << PDMA_DSCT_CTL_TXCNT_Pos));

    /* Set source/destination address and attributes */
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].SA = (uint32_t)g_au16MasterToSlaveTestPattern;
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].DA = (uint32_t)&USPI0->TXDAT;
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_SAINC_Msk | PDMA_DSCT_CTL_DAINC_Msk);
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL |= (PDMA_SAR_INC | PDMA_DAR_FIX);

    /* Set request source; set basic mode. */
    PDMA->REQSEL0_3 = (PDMA->REQSEL0_3 & ~PDMA_REQSEL0_3_REQSRC0_Msk) | PDMA_USCI0_TX;
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_OPMODE_Msk);
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL |= (PDMA_OP_BASIC);

    /* Single request type. USCI_SPI only support PDMA single request type. */
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_TXTYPE_Msk | PDMA_DSCT_CTL_BURSIZE_Msk);
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL |= (PDMA_REQ_SINGLE | 0);

    /* Disable table interrupt */
    PDMA->DSCT[USPI_MASTER_TX_DMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;

    /*=======================================================================
      USCI_SPI master PDMA RX channel configuration:
      -----------------------------------------------------------------------
        Word length = 16 bits
        Transfer Count = TEST_COUNT
        Source = USCI_SPI0->RX
        Source Address = Fixed
        Destination = g_au16MasterRxBuffer
        Destination Address = Increasing
        Burst Type = Single Transfer
    =========================================================================*/
    /* Set transfer width (16 bits) and transfer count */
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_TXCNT_Msk | PDMA_DSCT_CTL_TXWIDTH_Msk);
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL |= (PDMA_WIDTH_16 | ((TEST_COUNT - 1) << PDMA_DSCT_CTL_TXCNT_Pos));

    /* Set source/destination address and attributes */
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].SA = (uint32_t)&USPI0->RXDAT;
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].DA = (uint32_t)g_au16MasterRxBuffer;
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_SAINC_Msk | PDMA_DSCT_CTL_DAINC_Msk);
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL |= (PDMA_SAR_FIX | PDMA_DAR_INC);

    /* Set request source; set basic mode. */
    PDMA->REQSEL0_3 = (PDMA->REQSEL0_3 & ~PDMA_REQSEL0_3_REQSRC1_Msk) | (PDMA_USCI0_RX << PDMA_REQSEL0_3_REQSRC1_Pos);
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_OPMODE_Msk);
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL |= (PDMA_OP_BASIC);

    /* Single request type. SPI only support PDMA single request type. */
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL &= ~(PDMA_DSCT_CTL_TXTYPE_Msk | PDMA_DSCT_CTL_BURSIZE_Msk);
    PDMA->DSCT[USPI_MASTER_RX_DMA_CH].CTL |= (PDMA_REQ_SINGLE | 0);

